// Задайте двумерный массив из целых чисел. Найдите среднее арифметическое элементов в каждом столбце.
// Например, задан массив:
// 1 4 7 2
// 5 9 2 3
// 8 4 2 4
// Среднее арифметическое каждого столбца: 4,6; 5,6; 3,6; 3.

Console.Write("Введите количество строк в массиве:");
int numberOfRows = Convert.ToInt32(Console.ReadLine());
Console.Write("Введите количество столбцов в массиве:");
int columnNumber = Convert.ToInt32(Console.ReadLine());

int[,] GetArray()
{
    int[,] array = new int[numberOfRows, columnNumber];
    Random rnd = new Random();

    for (int i = 0; i < array.GetLength(0); i++)
    {
        for (int j = 0; j < array.GetLength(1); j++)
        {
            array[i, j] = rnd.Next(0, 100);
        }
    }
    return array;
}

void PrintArray(int[,] array)
{
    for (int i = 0; i < array.GetLength(0); i++)
    {
        for (int j = 0; j < array.GetLength(1); j++)
        {
            Console.Write($"{array[i, j]} ");
        }
        Console.WriteLine();
    }
}

void CheckArray(int[,] array)
{
 for (int j = 0; j < array.GetLength(1); j++)
{
    double sum = 0;
    for (int i = 0; i < array.GetLength(0); i++)
    {
        sum += array[i, j];
    }
    Console.Write($"{ sum / array.GetLength(0)} ");
}
}

int[,] array = GetArray();
Console.WriteLine("Массив: ");
PrintArray(array);
Console.WriteLine("==================");
CheckArray(array);
